Revit 2027 API
CriticalPathIterator Properties
The CriticalPathIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
CriticalPathIterator Class
Autodesk.Revit.DB.Analysis Namespace